virtualabs/cutcutgo/src/packs/PIC32CM5164LE00100_DFP/pio/pic32cm5164le00100.h
#define PIN_PB31E_TCC0_WO1                         _UINT32_(63)
#define MUX_PB31E_TCC0_WO1                         _UINT32_(4) 
#define PINMUX_PB31E_TCC0_WO1                      ((PIN_PB31E_TCC0_WO1 << 16) | MUX_PB31E_TCC0_WO1)
#define PORT_PB31E_TCC0_WO1                        (_UINT32_(1) << 31)

#define PIN_PA10J_TCC0_WO2                         _UINT32_(10)
#define MUX_PA10J_TCC0_WO2                         _UINT32_(9) 
#define PINMUX_PA10J_TCC0_WO2                      ((PIN_PA10J_TCC0_WO2 << 16) | MUX_PA10J_TCC0_WO2)
#define PORT_PA10J_TCC0_WO2                        (_UINT32_(1) << 10)

#define PIN_PA18J_TCC0_WO2                         _UINT32_(18)
#define MUX_PA18J_TCC0_WO2                         _UINT32_(9) 
#define PINMUX_PA18J_TCC0_WO2                      ((PIN_PA18J_TCC0_WO2 << 16) | MUX_PA18J_TCC0_WO2)
#define PORT_PA18J_TCC0_WO2                        (_UINT32_(1) << 18)

#define PIN_PB20J_TCC0_WO2                         _UINT32_(52)
#define MUX_PB20J_TCC0_WO2                         _UINT32_(9) 
#define PINMUX_PB20J_TCC0_WO2                      ((PIN_PB20J_TCC0_WO2 << 16) | MUX_PB20J_TCC0_WO2)
#define PORT_PB20J_TCC0_WO2                        (_UINT32_(1) << 20)

#define PIN_PA11J_TCC0_WO3                         _UINT32_(11)
#define MUX_PA11J_TCC0_WO3                         _UINT32_(9) 
#define PINMUX_PA11J_TCC0_WO3                      ((PIN_PA11J_TCC0_WO3 << 16) | MUX_PA11J_TCC0_WO3)
#define PORT_PA11J_TCC0_WO3                        (_UINT32_(1) << 11)

#define PIN_PA19J_TCC0_WO3                         _UINT32_(19)
#define MUX_PA19J_TCC0_WO3                         _UINT32_(9) 
#define PINMUX_PA19J_TCC0_WO3                      ((PIN_PA19J_TCC0_WO3 << 16) | MUX_PA19J_TCC0_WO3)
#define PORT_PA19J_TCC0_WO3                        (_UINT32_(1) << 19)

#define PIN_PB21J_TCC0_WO3                         _UINT32_(53)
#define MUX_PB21J_TCC0_WO3                         _UINT32_(9) 
#define PINMUX_PB21J_TCC0_WO3                      ((PIN_PB21J_TCC0_WO3 << 16) | MUX_PB21J_TCC0_WO3)
#define PORT_PB21J_TCC0_WO3                        (_UINT32_(1) << 21)

#define PIN_PA22J_TCC0_WO4                         _UINT32_(22)
#define MUX_PA22J_TCC0_WO4                         _UINT32_(9) 
#define PINMUX_PA22J_TCC0_WO4                      ((PIN_PA22J_TCC0_WO4 << 16) | MUX_PA22J_TCC0_WO4)
#define PORT_PA22J_TCC0_WO4                        (_UINT32_(1) << 22)

#define PIN_PB16J_TCC0_WO4                         _UINT32_(48)
#define MUX_PB16J_TCC0_WO4                         _UINT32_(9) 
#define PINMUX_PB16J_TCC0_WO4                      ((PIN_PB16J_TCC0_WO4 << 16) | MUX_PB16J_TCC0_WO4)
#define PORT_PB16J_TCC0_WO4                        (_UINT32_(1) << 16)

#define PIN_PA14J_TCC0_WO4                         _UINT32_(14)
#define MUX_PA14J_TCC0_WO4                         _UINT32_(9) 
#define PINMUX_PA14J_TCC0_WO4                      ((PIN_PA14J_TCC0_WO4 << 16) | MUX_PA14J_TCC0_WO4)
#define PORT_PA14J_TCC0_WO4                        (_UINT32_(1) << 14)

#define PIN_PA15J_TCC0_WO5                         _UINT32_(15)
#define MUX_PA15J_TCC0_WO5                         _UINT32_(9) 
#define PINMUX_PA15J_TCC0_WO5                      ((PIN_PA15J_TCC0_WO5 << 16) | MUX_PA15J_TCC0_WO5)
#define PORT_PA15J_TCC0_WO5                        (_UINT32_(1) << 15)

#define PIN_PA23J_TCC0_WO5                         _UINT32_(23)
#define MUX_PA23J_TCC0_WO5                         _UINT32_(9) 
#define PINMUX_PA23J_TCC0_WO5                      ((PIN_PA23J_TCC0_WO5 << 16) | MUX_PA23J_TCC0_WO5)
#define PORT_PA23J_TCC0_WO5                        (_UINT32_(1) << 23)

#define PIN_PB17J_TCC0_WO5                         _UINT32_(49)
#define MUX_PB17J_TCC0_WO5                         _UINT32_(9) 
#define PINMUX_PB17J_TCC0_WO5                      ((PIN_PB17J_TCC0_WO5 << 16) | MUX_PB17J_TCC0_WO5)
#define PORT_PB17J_TCC0_WO5                        (_UINT32_(1) << 17)

#define PIN_PA12J_TCC0_WO6                         _UINT32_(12)
#define MUX_PA12J_TCC0_WO6                         _UINT32_(9) 
#define PINMUX_PA12J_TCC0_WO6                      ((PIN_PA12J_TCC0_WO6 << 16) | MUX_PA12J_TCC0_WO6)
#define PORT_PA12J_TCC0_WO6                        (_UINT32_(1) << 12)

#define PIN_PA16J_TCC0_WO6                         _UINT32_(16)
#define MUX_PA16J_TCC0_WO6                         _UINT32_(9) 
#define PINMUX_PA16J_TCC0_WO6                      ((PIN_PA16J_TCC0_WO6 << 16) | MUX_PA16J_TCC0_WO6)
#define PORT_PA16J_TCC0_WO6                        (_UINT32_(1) << 16)

#define PIN_PA20J_TCC0_WO6                         _UINT32_(20)
#define MUX_PA20J_TCC0_WO6                         _UINT32_(9) 
#define PINMUX_PA20J_TCC0_WO6                      ((PIN_PA20J_TCC0_WO6 << 16) | MUX_PA20J_TCC0_WO6)
#define PORT_PA20J_TCC0_WO6                        (_UINT32_(1) << 20)

#define PIN_PB12J_TCC0_WO6                         _UINT32_(44)
#define MUX_PB12J_TCC0_WO6                         _UINT32_(9) 
#define PINMUX_PB12J_TCC0_WO6                      ((PIN_PB12J_TCC0_WO6 << 16) | MUX_PB12J_TCC0_WO6)
#define PORT_PB12J_TCC0_WO6                        (_UINT32_(1) << 12)

#define PIN_PA13J_TCC0_WO7                         _UINT32_(13)
#define MUX_PA13J_TCC0_WO7                         _UINT32_(9) 
#define PINMUX_PA13J_TCC0_WO7                      ((PIN_PA13J_TCC0_WO7 << 16) | MUX_PA13J_TCC0_WO7)
#define PORT_PA13J_TCC0_WO7                        (_UINT32_(1) << 13)

#define PIN_PA17J_TCC0_WO7                         _UINT32_(17)
#define MUX_PA17J_TCC0_WO7                         _UINT32_(9) 
#define PINMUX_PA17J_TCC0_WO7                      ((PIN_PA17J_TCC0_WO7 << 16) | MUX_PA17J_TCC0_WO7)
#define PORT_PA17J_TCC0_WO7                        (_UINT32_(1) << 17)

#define PIN_PA21J_TCC0_WO7                         _UINT32_(21)
#define MUX_PA21J_TCC0_WO7                         _UINT32_(9) 
#define PINMUX_PA21J_TCC0_WO7                      ((PIN_PA21J_TCC0_WO7 << 16) | MUX_PA21J_TCC0_WO7)
#define PORT_PA21J_TCC0_WO7                        (_UINT32_(1) << 21)

#define PIN_PB13J_TCC0_WO7                         _UINT32_(45)
#define MUX_PB13J_TCC0_WO7                         _UINT32_(9) 
#define PINMUX_PB13J_TCC0_WO7                      ((PIN_PB13J_TCC0_WO7 << 16) | MUX_PB13J_TCC0_WO7)
#define PORT_PB13J_TCC0_WO7                        (_UINT32_(1) << 13)

/* ========== PORT definition for TCC1 peripheral ========== */
#define PIN_PA06E_TCC1_WO0                         _UINT32_(6) 
#define MUX_PA06E_TCC1_WO0                         _UINT32_(4) 
#define PINMUX_PA06E_TCC1_WO0                      ((PIN_PA06E_TCC1_WO0 << 16) | MUX_PA06E_TCC1_WO0)
#define PORT_PA06E_TCC1_WO0                        (_UINT32_(1) << 6)

#define PIN_PA10E_TCC1_WO0                         _UINT32_(10)
#define MUX_PA10E_TCC1_WO0                         _UINT32_(4) 
#define PINMUX_PA10E_TCC1_WO0                      ((PIN_PA10E_TCC1_WO0 << 16) | MUX_PA10E_TCC1_WO0)
#define PORT_PA10E_TCC1_WO0                        (_UINT32_(1) << 10)

#define PIN_PA30E_TCC1_WO0                         _UINT32_(30)
#define MUX_PA30E_TCC1_WO0                         _UINT32_(4) 
#define PINMUX_PA30E_TCC1_WO0                      ((PIN_PA30E_TCC1_WO0 << 16) | MUX_PA30E_TCC1_WO0)
#define PORT_PA30E_TCC1_WO0                        (_UINT32_(1) << 30)

#define PIN_PA07E_TCC1_WO1                         _UINT32_(7) 
#define MUX_PA07E_TCC1_WO1                         _UINT32_(4) 
#define PINMUX_PA07E_TCC1_WO1                      ((PIN_PA07E_TCC1_WO1 << 16) | MUX_PA07E_TCC1_WO1)
#define PORT_PA07E_TCC1_WO1                        (_UINT32_(1) << 7)

