virtualabs/cutcutgo/src/packs/PIC32CM5164LE00100_DFP/pio/pic32cm5164le00100.h
#define PIN_PA11E_TCC1_WO1                         _UINT32_(11)
#define MUX_PA11E_TCC1_WO1                         _UINT32_(4) 
#define PINMUX_PA11E_TCC1_WO1                      ((PIN_PA11E_TCC1_WO1 << 16) | MUX_PA11E_TCC1_WO1)
#define PORT_PA11E_TCC1_WO1                        (_UINT32_(1) << 11)

#define PIN_PA31E_TCC1_WO1                         _UINT32_(31)
#define MUX_PA31E_TCC1_WO1                         _UINT32_(4) 
#define PINMUX_PA31E_TCC1_WO1                      ((PIN_PA31E_TCC1_WO1 << 16) | MUX_PA31E_TCC1_WO1)
#define PORT_PA31E_TCC1_WO1                        (_UINT32_(1) << 31)

#define PIN_PA08J_TCC1_WO2                         _UINT32_(8) 
#define MUX_PA08J_TCC1_WO2                         _UINT32_(9) 
#define PINMUX_PA08J_TCC1_WO2                      ((PIN_PA08J_TCC1_WO2 << 16) | MUX_PA08J_TCC1_WO2)
#define PORT_PA08J_TCC1_WO2                        (_UINT32_(1) << 8)

#define PIN_PA24J_TCC1_WO2                         _UINT32_(24)
#define MUX_PA24J_TCC1_WO2                         _UINT32_(9) 
#define PINMUX_PA24J_TCC1_WO2                      ((PIN_PA24J_TCC1_WO2 << 16) | MUX_PA24J_TCC1_WO2)
#define PORT_PA24J_TCC1_WO2                        (_UINT32_(1) << 24)

#define PIN_PB30J_TCC1_WO2                         _UINT32_(62)
#define MUX_PB30J_TCC1_WO2                         _UINT32_(9) 
#define PINMUX_PB30J_TCC1_WO2                      ((PIN_PB30J_TCC1_WO2 << 16) | MUX_PB30J_TCC1_WO2)
#define PORT_PB30J_TCC1_WO2                        (_UINT32_(1) << 30)

#define PIN_PA09J_TCC1_WO3                         _UINT32_(9) 
#define MUX_PA09J_TCC1_WO3                         _UINT32_(9) 
#define PINMUX_PA09J_TCC1_WO3                      ((PIN_PA09J_TCC1_WO3 << 16) | MUX_PA09J_TCC1_WO3)
#define PORT_PA09J_TCC1_WO3                        (_UINT32_(1) << 9)

#define PIN_PA25J_TCC1_WO3                         _UINT32_(25)
#define MUX_PA25J_TCC1_WO3                         _UINT32_(9) 
#define PINMUX_PA25J_TCC1_WO3                      ((PIN_PA25J_TCC1_WO3 << 16) | MUX_PA25J_TCC1_WO3)
#define PORT_PA25J_TCC1_WO3                        (_UINT32_(1) << 25)

#define PIN_PB31J_TCC1_WO3                         _UINT32_(63)
#define MUX_PB31J_TCC1_WO3                         _UINT32_(9) 
#define PINMUX_PB31J_TCC1_WO3                      ((PIN_PB31J_TCC1_WO3 << 16) | MUX_PB31J_TCC1_WO3)
#define PORT_PB31J_TCC1_WO3                        (_UINT32_(1) << 31)

/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_PA12E_TCC2_WO0                         _UINT32_(12)
#define MUX_PA12E_TCC2_WO0                         _UINT32_(4) 
#define PINMUX_PA12E_TCC2_WO0                      ((PIN_PA12E_TCC2_WO0 << 16) | MUX_PA12E_TCC2_WO0)
#define PORT_PA12E_TCC2_WO0                        (_UINT32_(1) << 12)

#define PIN_PA16E_TCC2_WO0                         _UINT32_(16)
#define MUX_PA16E_TCC2_WO0                         _UINT32_(4) 
#define PINMUX_PA16E_TCC2_WO0                      ((PIN_PA16E_TCC2_WO0 << 16) | MUX_PA16E_TCC2_WO0)
#define PORT_PA16E_TCC2_WO0                        (_UINT32_(1) << 16)

#define PIN_PA00E_TCC2_WO0                         _UINT32_(0) 
#define MUX_PA00E_TCC2_WO0                         _UINT32_(4) 
#define PINMUX_PA00E_TCC2_WO0                      ((PIN_PA00E_TCC2_WO0 << 16) | MUX_PA00E_TCC2_WO0)
#define PORT_PA00E_TCC2_WO0                        (_UINT32_(1) << 0)

#define PIN_PA13E_TCC2_WO1                         _UINT32_(13)
#define MUX_PA13E_TCC2_WO1                         _UINT32_(4) 
#define PINMUX_PA13E_TCC2_WO1                      ((PIN_PA13E_TCC2_WO1 << 16) | MUX_PA13E_TCC2_WO1)
#define PORT_PA13E_TCC2_WO1                        (_UINT32_(1) << 13)

#define PIN_PA17E_TCC2_WO1                         _UINT32_(17)
#define MUX_PA17E_TCC2_WO1                         _UINT32_(4) 
#define PINMUX_PA17E_TCC2_WO1                      ((PIN_PA17E_TCC2_WO1 << 16) | MUX_PA17E_TCC2_WO1)
#define PORT_PA17E_TCC2_WO1                        (_UINT32_(1) << 17)

#define PIN_PA01E_TCC2_WO1                         _UINT32_(1) 
#define MUX_PA01E_TCC2_WO1                         _UINT32_(4) 
#define PINMUX_PA01E_TCC2_WO1                      ((PIN_PA01E_TCC2_WO1 << 16) | MUX_PA01E_TCC2_WO1)
#define PORT_PA01E_TCC2_WO1                        (_UINT32_(1) << 1)

/* ========== PORT definition for TCC3 peripheral ========== */
#define PIN_PA02J_TCC3_WO0                         _UINT32_(2) 
#define MUX_PA02J_TCC3_WO0                         _UINT32_(9) 
#define PINMUX_PA02J_TCC3_WO0                      ((PIN_PA02J_TCC3_WO0 << 16) | MUX_PA02J_TCC3_WO0)
#define PORT_PA02J_TCC3_WO0                        (_UINT32_(1) << 2)

#define PIN_PB22J_TCC3_WO0                         _UINT32_(54)
#define MUX_PB22J_TCC3_WO0                         _UINT32_(9) 
#define PINMUX_PB22J_TCC3_WO0                      ((PIN_PB22J_TCC3_WO0 << 16) | MUX_PB22J_TCC3_WO0)
#define PORT_PB22J_TCC3_WO0                        (_UINT32_(1) << 22)

#define PIN_PA03J_TCC3_WO1                         _UINT32_(3) 
#define MUX_PA03J_TCC3_WO1                         _UINT32_(9) 
#define PINMUX_PA03J_TCC3_WO1                      ((PIN_PA03J_TCC3_WO1 << 16) | MUX_PA03J_TCC3_WO1)
#define PORT_PA03J_TCC3_WO1                        (_UINT32_(1) << 3)

#define PIN_PB23J_TCC3_WO1                         _UINT32_(55)
#define MUX_PB23J_TCC3_WO1                         _UINT32_(9) 
#define PINMUX_PB23J_TCC3_WO1                      ((PIN_PB23J_TCC3_WO1 << 16) | MUX_PB23J_TCC3_WO1)
#define PORT_PB23J_TCC3_WO1                        (_UINT32_(1) << 23)

#define PIN_PA04J_TCC3_WO2                         _UINT32_(4) 
#define MUX_PA04J_TCC3_WO2                         _UINT32_(9) 
#define PINMUX_PA04J_TCC3_WO2                      ((PIN_PA04J_TCC3_WO2 << 16) | MUX_PA04J_TCC3_WO2)
#define PORT_PA04J_TCC3_WO2                        (_UINT32_(1) << 4)

#define PIN_PB02J_TCC3_WO2                         _UINT32_(34)
#define MUX_PB02J_TCC3_WO2                         _UINT32_(9) 
#define PINMUX_PB02J_TCC3_WO2                      ((PIN_PB02J_TCC3_WO2 << 16) | MUX_PB02J_TCC3_WO2)
#define PORT_PB02J_TCC3_WO2                        (_UINT32_(1) << 2)

#define PIN_PA05J_TCC3_WO3                         _UINT32_(5) 
#define MUX_PA05J_TCC3_WO3                         _UINT32_(9) 
#define PINMUX_PA05J_TCC3_WO3                      ((PIN_PA05J_TCC3_WO3 << 16) | MUX_PA05J_TCC3_WO3)
#define PORT_PA05J_TCC3_WO3                        (_UINT32_(1) << 5)

#define PIN_PB03J_TCC3_WO3                         _UINT32_(35)
#define MUX_PB03J_TCC3_WO3                         _UINT32_(9) 
#define PINMUX_PB03J_TCC3_WO3                      ((PIN_PB03J_TCC3_WO3 << 16) | MUX_PB03J_TCC3_WO3)
#define PORT_PB03J_TCC3_WO3                        (_UINT32_(1) << 3)

#define PIN_PA06J_TCC3_WO4                         _UINT32_(6) 
#define MUX_PA06J_TCC3_WO4                         _UINT32_(9) 
#define PINMUX_PA06J_TCC3_WO4                      ((PIN_PA06J_TCC3_WO4 << 16) | MUX_PA06J_TCC3_WO4)
#define PORT_PA06J_TCC3_WO4                        (_UINT32_(1) << 6)

