virtualabs/cutcutgo/src/packs/PIC32CM5164LE00100_DFP/pio/pic32cm5164le00100.h
#define PIN_PA30J_TCC3_WO4                         _UINT32_(30)
#define MUX_PA30J_TCC3_WO4                         _UINT32_(9) 
#define PINMUX_PA30J_TCC3_WO4                      ((PIN_PA30J_TCC3_WO4 << 16) | MUX_PA30J_TCC3_WO4)
#define PORT_PA30J_TCC3_WO4                        (_UINT32_(1) << 30)

#define PIN_PA07J_TCC3_WO5                         _UINT32_(7) 
#define MUX_PA07J_TCC3_WO5                         _UINT32_(9) 
#define PINMUX_PA07J_TCC3_WO5                      ((PIN_PA07J_TCC3_WO5 << 16) | MUX_PA07J_TCC3_WO5)
#define PORT_PA07J_TCC3_WO5                        (_UINT32_(1) << 7)

#define PIN_PA31J_TCC3_WO5                         _UINT32_(31)
#define MUX_PA31J_TCC3_WO5                         _UINT32_(9) 
#define PINMUX_PA31J_TCC3_WO5                      ((PIN_PA31J_TCC3_WO5 << 16) | MUX_PA31J_TCC3_WO5)
#define PORT_PA31J_TCC3_WO5                        (_UINT32_(1) << 31)

#define PIN_PB08J_TCC3_WO6                         _UINT32_(40)
#define MUX_PB08J_TCC3_WO6                         _UINT32_(9) 
#define PINMUX_PB08J_TCC3_WO6                      ((PIN_PB08J_TCC3_WO6 << 16) | MUX_PB08J_TCC3_WO6)
#define PORT_PB08J_TCC3_WO6                        (_UINT32_(1) << 8)

#define PIN_PB09J_TCC3_WO7                         _UINT32_(41)
#define MUX_PB09J_TCC3_WO7                         _UINT32_(9) 
#define PINMUX_PB09J_TCC3_WO7                      ((PIN_PB09J_TCC3_WO7 << 16) | MUX_PB09J_TCC3_WO7)
#define PORT_PB09J_TCC3_WO7                        (_UINT32_(1) << 9)

/* ========== PORT definition for USB peripheral ========== */
#define PIN_PA24G_USB_DM                           _UINT32_(24)
#define MUX_PA24G_USB_DM                           _UINT32_(6) 
#define PINMUX_PA24G_USB_DM                        ((PIN_PA24G_USB_DM << 16) | MUX_PA24G_USB_DM)
#define PORT_PA24G_USB_DM                          (_UINT32_(1) << 24)

#define PIN_PA25G_USB_DP                           _UINT32_(25)
#define MUX_PA25G_USB_DP                           _UINT32_(6) 
#define PINMUX_PA25G_USB_DP                        ((PIN_PA25G_USB_DP << 16) | MUX_PA25G_USB_DP)
#define PORT_PA25G_USB_DP                          (_UINT32_(1) << 25)

#define PIN_PB22G_USB_SOF_1KHZ                     _UINT32_(54)
#define MUX_PB22G_USB_SOF_1KHZ                     _UINT32_(6) 
#define PINMUX_PB22G_USB_SOF_1KHZ                  ((PIN_PB22G_USB_SOF_1KHZ << 16) | MUX_PB22G_USB_SOF_1KHZ)
#define PORT_PB22G_USB_SOF_1KHZ                    (_UINT32_(1) << 22)



#endif /* _PIC32CM5164LE00100_GPIO_H_ */

